# Latihan 1

Single Entity
1. Prepare a list of offices sorted by country, state, city.
2. How many employees are there in the company?
3. What is the total of payments received?
4. List the product lines that contain 'Cars'.
5. Report total payments for October 28, 2004.
6. Report those payments greater than \$100,000.
7. List the products in each product line.
8. How many products in each product line?
9. What is the minimum payment received?
10. List all payments greater than twice the average payment.
11. What is the average percentage markup of the MSRP on buyPrice?
12. How many distinct products does ClassicModels sell?
13. Report the name and city of customers who don't have sales representatives?
14. What are the names of executives with VP or Manager in their title? Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.
15. Which orders have a value greater than $5,000?
------
### Answer

Preparing MySQL conncetion

In [7]:
import mysql.connector
import pandas as pd

user = "root"
passwd = "root"
host = "127.0.0.1"
database = "classicmodels"

conn = mysql.connector.connect(user=user, password=passwd,
                              host=host,
                              database=database)

1. List of offices sorted by country, state, and city.

list_of_offices = pd.read_sql_query("SELECT * FROM offices ORDER BY country, state, city", conn)
print (list_of_offices)

2. How many employees are there in the company?

In [11]:
total_employees = pd.read_sql_query("SELECT COUNT(employeeNumber) AS Total_Employees FROM employees", conn)
print (total_employees)

   Total_Employees
0               23

3. What is the total of payments received?

In [13]:
received_payments = pd.read_sql_query("SELECT SUM(amount) AS Received FROM payments", conn)
print (received_payments)

     Received
0  8853839.23

4. List the product lines that contain 'Cars'.

In [16]:
cars_product = pd.read_sql_query("SELECT productLine FROM productlines WHERE productLine LIKE '%Cars%'", conn)
print (cars_product)

    productLine
0  Classic Cars
1  Vintage Cars

5. Report total payments for October 28, 2004.

In [18]:
payment_at_28_10_2004 = pd.read_sql_query("SELECT SUM(amount) AS Total_Payment FROM payments WHERE paymentDate = '2004-10-28'", conn)
print (payment_at_28_10_2004)

   Total_Payment
0       47411.33

6. Report those payments greater than $100,000.

In [30]:
payment_100 = pd.read_sql_query("SELECT * FROM payments WHERE amount > 100000", conn)
print (payment_100_bucks)

   customerNumber checkNumber paymentDate     amount
0             124    AE215433  2005-03-05  101244.59
1             124    KI131716  2003-08-15  111654.40
2             141     ID10962  2004-12-31  116208.40
3             141    JE105477  2005-03-18  120166.58
4             148    KM172879  2003-12-26  105743.00

7. List the products in each product line.

In [21]:
products = pd.read_sql_query("SELECT productLine, productName FROM products ORDER BY productLine", conn)
print (products)

          productLine                                  productName
0        Classic Cars                     1952 Alpine Renault 1300
1        Classic Cars                          1972 Alfa Romeo GTA
2        Classic Cars                       1962 LanciaA Delta 16V
3        Classic Cars                            1968 Ford Mustang
4        Classic Cars                            2001 Ferrari Enzo
5        Classic Cars                           1969 Corvair Monza
6        Classic Cars                           1968 Dodge Charger
7        Classic Cars                             1969 Ford Falcon
8        Classic Cars                      1970 Plymouth Hemi Cuda
9        Classic Cars                           1969 Dodge Charger
10       Classic Cars                              1993 Mazda RX-7
11       Classic Cars                        1965 Aston Martin DB5
12       Classic Cars                  1948 Porsche 356-A Roadster
13       Classic Cars                             1995 Honda Civic
14       Classic Cars               1998 Chrysler Plymouth Prowler
15       Classic Cars                 1999 Indy 500 Monte Carlo SS
16       Classic Cars                  1992 Ferrari 360 Spider red
17       Classic Cars                            1985 Toyota Supra
18       Classic Cars                         1969 Dodge Super Bee
19       Classic Cars                        1976 Ford Gran Torino
20       Classic Cars               1948 Porsche Type 356 Roadster
21       Classic Cars                        1970 Triumph Spitfire
22       Classic Cars                    1957 Corvette Convertible
23       Classic Cars                        1957 Ford Thunderbird
24       Classic Cars                   1970 Chevy Chevelle SS 454
25       Classic Cars                           1970 Dodge Coronet
26       Classic Cars                    1966 Shelby Cobra 427 S/C
27       Classic Cars                           1949 Jaguar XK 120
28       Classic Cars          1958 Chevy Corvette Limited Edition
29       Classic Cars                            1952 Citroen-15CV
..                ...                                          ...
80   Trucks and Buses                             1940s Ford truck
81   Trucks and Buses                     1962 Volkswagen Microbus
82   Trucks and Buses                  1980â€™s GM Manhattan Express
83   Trucks and Buses                  1954 Greyhound Scenicruiser
84   Trucks and Buses  1996 Peterbilt 379 Stake Bed with Outrigger
85   Trucks and Buses             Diamond T620 Semi-Skirted Tanker
86       Vintage Cars                         1937 Lincoln Berline
87       Vintage Cars     1936 Mercedes-Benz 500K Special Roadster
88       Vintage Cars                     1917 Grand Touring Sedan
89       Vintage Cars                           1911 Ford Town Car
90       Vintage Cars                    1932 Model A Ford J-Coupe
91       Vintage Cars                       1928 Mercedes-Benz SSK
92       Vintage Cars                  1913 Ford Model T Speedster
93       Vintage Cars                           1934 Ford V8 Coupe
94       Vintage Cars          18th Century Vintage Horse Carriage
95       Vintage Cars                            1903 Ford Model A
96       Vintage Cars                     1917 Maxwell Touring Car
97       Vintage Cars      1941 Chevrolet Special Deluxe Cabriolet
98       Vintage Cars          1932 Alfa Romeo 8C2300 Spider Sport
99       Vintage Cars                          1904 Buick Runabout
100      Vintage Cars                      1939 Cadillac Limousine
101      Vintage Cars                  1939 Chevrolet Deluxe Coupe
102      Vintage Cars    1938 Cadillac V-16 Presidential Limousine
103      Vintage Cars             1912 Ford Model T Delivery Wagon
104      Vintage Cars                    1937 Horch 930V Limousine
105      Vintage Cars                     1940 Ford Delivery Sedan
106      Vintage Cars             1936 Mercedes Benz 500k Roadster
107      Vintage Cars                        1936 Chrysler Airflow
108      Vintage Cars                     1928 Ford Phaeton Deluxe
109      Vintage Cars                 1930 Buick Marquette Phaeton

[110 rows x 2 columns]

8. How many products in each product line?

In [23]:
product_line_items = pd.read_sql_query("SELECT productLine, COUNT(productName) AS Items FROM products GROUP BY productLine", conn)
print (product_line_items)

        productLine  Items
0      Classic Cars     38
1       Motorcycles     13
2            Planes     12
3             Ships      9
4            Trains      3
5  Trucks and Buses     11
6      Vintage Cars     24

9. What is the minimum payment received?

In [24]:
minimum_payment = pd.read_sql_query("SELECT MIN(amount) AS Minimum_Payment FROM payments", conn)
print (minimum_payment)

   Minimum_Payment
0           615.45

10. List all payments greater than twice the average payment.

In [25]:
payment_2avg = pd.read_sql_query("SELECT amount FROM payments WHERE amount > ( SELECT AVG(amount) * 2 FROM payments )", conn)
print (payment_2avg)

       amount
0    82261.22
1   101244.59
2    85410.87
3    83598.04
4   111654.40
5   116208.40
6    65071.26
7   120166.58
8   105743.00
9    85024.46
10   80375.24
11   85559.12
12   75020.13

11. What is the average percentage markup of the MSRP on buyPrice?

In [32]:
avg_perc_markup = pd.read_sql_query("SELECT AVG((MSRP - buyPrice) / buyPrice * 100) AS Markup_AVG FROM products", conn)
print (avg_perc_markup)

   Markup_AVG
0   88.702392

12. How many distinct products does ClassicModels sell?

In [27]:
items = pd.read_sql_query("SELECT COUNT(DISTINCT(productName)) AS Produk FROM products", conn)
print (items)

   Produk
0     110

13. Report the name and city of customers who don't have sales representatives?

In [28]:
customers_not_sales = pd.read_sql_query("SELECT customerName, CONCAT(contactFirstName, contactLastName) AS CP, city FROM customers WHERE salesRepEmployeeNumber IS NULL", conn)
print (items)

   Produk
0     110

14. What are the names of executives with VP or Manager in their title? Use the CONCAT function to combine the employee's first name and last name into a single field for reporting.

In [29]:
executives = pd.read_sql_query('SELECT CONCAT(firstName, " ", lastName) AS FullName FROM employees WHERE jobTitle LIKE "%VP%" OR jobTitle LIKE "%Manager%"', conn)
print (executives)

            FullName
0     Mary Patterson
1      Jeff Firrelli
2  William Patterson
3      Gerard Bondur
4        Anthony Bow

15. Which orders have a value greater than $5,000?

In [31]:
order_5 = pd.read_sql_query("SELECT DISTINCT(orderNumber), SUM(priceEach * orderLineNumber) AS Total_Harga FROM orderdetails GROUP BY orderNumber HAVING Total_Harga > 5000", conn)
print (order_5)

     orderNumber  Total_Harga
0          10103     12932.73
1          10104      9063.73
2          10105     13254.39
3          10106     13243.28
4          10108     11246.46
5          10110     11392.76
6          10114      5372.00
7          10117      9178.29
8          10119      8028.36
9          10120      9607.93
10         10122     13477.83
11         10124      7345.33
12         10126     14263.89
13         10127     11723.76
14         10135     12960.78
15         10138      7266.43
16         10140      6874.56
17         10142     14256.89
18         10143     11059.54
19         10145     12227.07
20         10147      6166.72
21         10148     11413.26
22         10149      5639.86
23         10150      6395.68
24         10151      5158.04
25         10153     10026.93
26         10155      7933.42
27         10159     16036.73
28         10161      8348.88
29         10165     16365.89
..           ...          ...
118        10347      6854.23
119        10349      6911.50
120        10350     11648.79
121        10354      8653.34
122        10357      6341.98
123        10358     10390.05
124        10360     14715.31
125        10361      8161.82
126        10363      9774.75
127        10367      6607.02
128        10371      7016.08
129        10373     11079.50
130        10375     10795.31
131        10380      7652.62
132        10382     10556.51
133        10383      8166.96
134        10386     12578.82
135        10390     12900.58
136        10391      5248.61
137        10393      7049.73
138        10398     13837.15
139        10401      5583.03
140        10407      7156.94
141        10411      5028.96
142        10412      6205.86
143        10414      9009.82
144        10416      8309.17
145        10419     10659.93
146        10420      7200.61
147        10425      9016.55

[148 rows x 2 columns]